SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( SNCF_BB25574_GV1_ORTS

    comment ( Paramétrage BB25500 par BJPaul et BB25187 - http://bb25187.eu - 2015/10/11 )

    comment (-------- Nom et formes --------)
    Type ( Engine )
    Wagonshape ( SNCF_BB25500_V0_1_ORTS.s )
    Freightanim ( Tsk_BB25574_V1_Mec.s 1 1 )

    comment (-------- Caracteristiques generales --------)
    Mass ( 79t )
    Size ( 3.17m 4.26m 14.94m )
    InertiaTensor ( Box ( 3.17m 4.26m 14.94m ) )
    Centreofgravity ( 0.0m 1.5m 0.0m )

    comment (-------- Roulement --------)
    NumWheels ( 4 )
    Wheelradius ( 0.55m )
    Adheasion ( 0.273 0.41 2 0 )

    Friction (
        1017.0N/m/s      -0.10      1.2mph        8.950N/m/s    1.863
        5.1N/rad/s        1        -1rad/s        0             1
    )

    AntiSlip ( 1 )

    ORTSDavis_A ( 1016.97 )
    ORTSDavis_B ( 25.8633 )
    ORTSDavis_C ( 4.819734 )
    ORTSBearingType ( Roller )

    comment (-------- Deraillement --------)
    DerailRailHeight ( 4cm )
    DerailRailForce ( 230kN )
    DerailBufferForce ( 200kN )

    comment (-------- Attelage --------)
    Coupling (
        Type ( Chain )
        Spring (
            Stiffness ( 1e6N/m 5e6N/m )
            Damping ( 1e6N/m/s 1e6N/m/s )
            Break ( 1.1e9N 1.1e9N )
            r0 ( 20cm 30cm )
        )
        CouplingHasRigidConnection ( 0 )
        Velocity ( 0.1m/s )
    )
    Buffers (
        Spring (
            Stiffness ( 1e6N/m 5e6N/m )
            Damping ( 1e6N/m/s 1e6N/m/s )
            r0 ( 0m 1e9 )
        )
        Centre ( 0.5 )
        Radius ( 1 )
        Angle ( 0.5deg )
    )

    comment (-------- Freinage --------)
    BrakeEquipmentType ( "Auxilary_reservoir, Distributor" )
    BrakeSystemType ( "Air_single_pipe" )
    MaxBrakeForce ( 45kN )
    comment ( MaxHandbrakeForce ( 205kN ) )
    MaxReleaseRate ( 6 )
    MaxApplicationRate ( 6 )
    comment ( MaxAuxilaryChargingRate ( 25 ) )

    BrakeDistributorTrainPipeAuxResPressureDifferenceForApplication ( 1 )
    BrakeDistributorEmergencyApplicationPressure ( 51 )
    BrakeDistributorEmergencyApplicationRate ( 3 )

    BrakeCylinderPressureForMaxBrakeBrakeForce ( 51 )

    BrakeDistributorFullServicePressure ( 43.0 )
    BrakeDistributorMaxAuxilaryResPressure ( 73 )
    BrakeDistributorEmergencyResPressure ( 51 )
    BrakeDistributorReleaseRate ( 12.6 )
    BrakeDistributorApplicationRate ( 55.16 )
    BrakeDistributorTrainPipeControlRatio ( 3.1 )
    BrakeDistributorNormalFullReleasePressure ( 73 )

    comment (-------- Projos et fanaux --------)
    Lights ( 15
        comment ( == Player section - Normal ================== )
        Light (
            comment ( Sphere of light forward Bright )
            Type ( 1 )
            Conditions (
                Headlight ( 3 )
                Unit ( 2 )
            )
            Cycle ( 0 )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( 33f8e5bd )
                    Position ( 0.0 0.2 30.0 )
                    Transition ( 0 )
                    Radius ( 30.0 )
                    Angle ( 10.0 )
                )
            )
        )
        Light (
            comment ( Headlight bottom right dim )
            Type ( 0 )
            Conditions (
                Headlight ( 2 )
                Unit ( 2 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( ffff0000 )
                    Position ( 0.646 1.628 6.82 )
                    Azimuth ( 0.0 -5.0 5.0 )
                    Transition ( 0 )
                    Radius ( 0.3 )
                )
            )
        )
        Light (
            comment ( Headlight bottom left dim )
            Type ( 0 )
            Conditions (
                Headlight ( 2 )
                Unit ( 2 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( ffff0000 )
                    Position ( -0.646 1.628 6.82 )
                    Azimuth ( 0.0 -5.0 5.0 )
                    Transition ( 0 )
                    Radius ( 0.3 )
                )
            )
        )
        Light (
            comment ( Headlight bottom right bright )
            Type ( 0 )
            Conditions (
                Headlight ( 3 )
                Unit ( 2 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( fff8e5bd )
                    Position ( 0.813 1.832 6.82 )
                    Azimuth ( 0.0 -5.0 5.0 )
                    Transition ( 0 )
                    Radius ( 0.4 )
                )
            )
        )
        Light (
            comment ( Headlight bottom left bright )
            Type ( 0 )
            Conditions (
                Headlight ( 3 )
                Unit ( 2 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( fff8e5bd )
                    Position ( -0.813 1.832 6.82 )
                    Azimuth ( 0.0 -5.0 5.0 )
                    Transition ( 0 )
                    Radius ( 0.4 )
                )
            )
        )
        Light (
            comment ( Rear red light left dim)
            Type ( 0 )
            Conditions (
                Headlight ( 2 )
                Unit ( 3 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( fff8e5bd )
                    Position ( -0.813 1.832 -6.82 )
                    Azimuth ( -180 -180 -180 )
                    Transition ( 0 )
                    Radius ( 0.4 )
                )
            )
        )
        Light (
            comment ( Rear red light rigt dim)
            Type ( 0 )
            Conditions (
                Headlight ( 2 )
                Unit ( 3 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( fff8e5bd )
                    Position ( 0.813 1.832 -6.82 )
                    Azimuth ( -180 -180 -180 )
                    Transition ( 0 )
                    Radius ( 0.4 )
                )
            )
        )
        Light (
            comment ( Rear red light left bright)
            Type ( 0 )
            Conditions (
                Headlight ( 3 )
                Unit ( 3 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( ffff0000 )
                    Position ( -0.646 1.628 -6.82 )
                    Azimuth ( -180 -180 -180 )
                    Transition ( 0 )
                    Radius ( 0.3 )
                )
            )
        )
        Light (
            comment ( Rear red light right bright)
            Type ( 0 )
            Conditions (
                Headlight ( 3 )
                Unit ( 3 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( ffff0000 )
                    Position ( 0.646 1.628 -6.82 )
                    Azimuth ( -180 -180 -180 )
                    Transition ( 0 )
                    Radius ( 0.3 )
                )
            )
        )
        comment ( == Traffic section ================== )
        Light (
            comment ( Headlight bottom right bright )
            Type ( 0 )
            Conditions (
                Unit ( 2 )
                Control ( 1 )
                Service ( 2 )
                TimeOfDay ( 0 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( fff8e5bd )
                    Position ( 0.813 1.832 6.82 )
                    Azimuth ( 0.0 -5.0 5.0 )
                    Transition ( 0 )
                    Radius ( 0.4 )
                )
            )
        )
        Light (
            comment ( Headlight bottom left bright )
            Type ( 0 )
            Conditions (
                Unit ( 2 )
                Control ( 1 )
                Service ( 2 )
                TimeOfDay ( 0 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( fff8e5bd )
                    Position ( -0.813 1.832 6.82 )
                    Azimuth ( 0.0 -5.0 5.0 )
                    Transition ( 0 )
                    Radius ( 0.4 )
                )
            )
        )
        Light (
            comment ( Rear red light left bright)
            Type ( 0 )
            Conditions (
                Unit ( 3 )
                Control ( 1 )
                Service ( 2 )
                TimeOfDay ( 0 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( ffff0000 )
                    Position ( -0.646 1.628 6.82 )
                    Azimuth ( -180 -180 -180 )
                    Transition ( 0 )
                    Radius ( 0.7 )
                )
            )
        )
        Light (
            comment ( Rear red light right bright)
            Type ( 0 )
            Conditions (
                Unit ( 3 )
                Control ( 1 )
                Service ( 2 )
                TimeOfDay ( 0 )
            )
            FadeIn ( 0.5 )
            FadeOut ( 0.5 )
            Cycle ( 0 )
            States (    1
                State (
                    Duration ( 0.0 )
                    LightColour ( ffff0000 )
                    Position ( 0.646 1.628 6.82 )
                    Azimuth ( -180 -180 -180 )
                    Transition ( 0 )
                    Radius ( 0.7 )
                )
            )
        )
        comment ( == Pantograph ================== )
        Light (
            Type ( 0 )
            Conditions (
                Headlight ( 3 )
                Unit ( 3 )
            )
            FadeIn ( 0 )
            FadeOut ( 0 )
            Cycle ( 0 )
            States ( 9
                State (
                    Duration ( 2.5 )
                    LightColour ( 00F4097E )
                    Position ( 0 5.483 4.350 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.53 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 0.04 )
                    LightColour ( FFAAAAFF )
                    Position ( 0 5.493 4.380 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.43 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 3.7 )
                    LightColour ( 00F4097E )
                    Position ( 0 5.480 4.360 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.69 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 0.09 )
                    LightColour ( FFAAAAFF )
                    Position ( 0 5.470 4.370 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.70 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 0.03 )
                    LightColour ( 00F4097E )
                    Position ( 0 5.458 4.340 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.73 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 0.05 )
                    LightColour ( FFAAAAFF )
                    Position ( 0 5.454 4.350 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.71 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 5.1 )
                    LightColour ( 00F4097E )
                    Position ( 0 5.480 4.370 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.55 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 0.07 )
                    LightColour ( FFAAAAFF )
                    Position ( 0 5.480 4.360 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.65 )
                    Elevation ( 0 -90 90 )
                )
                State (
                    Duration ( 2.3 )
                    LightColour ( 00F4097E )
                    Position ( 0 5.480 4.340 )
                    Azimuth ( 0.0 -180.0 180.0)
                    Transition ( 0 )
                    Radius ( 0.77 )
                    Elevation ( 0 -90 90 )
                )
            )
        )
    )

    Sound ("bb25660GVCONTeng.sms" )
)

Engine ( SNCF_BB25574_GV1_ORTS

    comment (-------- Caracteristiques generales --------)
    Name ( "SNCF_BB25574_GV1_ORTS (Frog)" )
    Wagon ( SNCF_BB25574_GV1_ORTS )
    Sound ("bb25660GVCONTcab.sms" )
    CabView ( BB25660_1500V.cvf )
    HeadOut ( -1.70 3.00 5.82 )

    Type ( Electric )

    comment ( 140 km/h en service commercial - adapter dans le consist! )
    MaxVelocity ( 150kmh )

    comment ( Diamètre réel )
    WheelRadius ( 0.55m )

    comment ( Puissance maximale aux moteurs - à la jante ce sera moins  )
    MaxPower ( 2940kW )

    MaxForce ( 482.74kN )
    MaxContinuousForce ( 482.74kN )

    comment ( Artefact ! )
    comment ( DieselEngineSpeedOfMaxTractiveEffort ( 82.50kmh ) )
    comment ( RunUpTimeToMaxForce ( 30.0 ) )

    comment ( 1400 A au démarrage, 1000 A en continu )
    MaxCurrent ( 1400 )
    NumWheels ( 4 )
    Sanding ( 1e9mph )

    comment ( Pour le fun au minimum )
    comment ( AntiSlip ( 0 ) )
    comment ( Devrait suffire en temps normal ! )
    MaxSandingTime ( 1800s )

    comment ( Idéal pour les meringues ! )
    comment ( MaxTemperature ( 110 ) )

    comment ( On doit pouvoir mettre moins, ou plus, c'est selon...! )
    comment ( MaxOilPressure ( 90 ) )

    AirBrakesAirCompressorPowerRating ( 36 )
    AirBrakesAirCompressorWattage ( 50000 )
    AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 0.2 )
    AirBrakesCompressorRestartPressure ( 85 )
    AirBrakesHasLowPressureTest ( 1 )
    AirBrakesIsCompressorElectricOrMechanical ( 1 )
    AirBrakesMainMaxAirPressure ( 100 )
    AirBrakesMainMinResAirPressure ( 0 )
    AirBrakesMainResVolume ( 100 )
    AirBrakeMaxMainResPipePressure ( 73 )

    EngineBrakesControllerMinPressureReduction ( 6 )
    EngineBrakesControllerMaxApplicationRate ( 20 )
    EngineBrakesControllerMaxReleaseRate ( 25 )
    EngineBrakesControllerEmergencyApplicationRate ( 50 )
    EngineBrakesControllerMinSystemPressure ( 0 )
    EngineBrakesControllerMaxSystemPressure ( 90 )
    EngineBrakesControllerMaxPressureDropInNormalApplication ( 73 )
    EngineBrakesControllerFullServicePressureDrop ( 26 )
    EngineBrakesControllerDirectControlExponent ( 1 )
    EngineBrakesControllerHasProportionalBrake ( 1 )
    EngineBrakesProportionalBrakeLag ( 1 )

    TrainBrakesControllerMinPressureReduction ( 6 )
    TrainBrakesControllerMaxApplicationRate ( 6 )
    TrainBrakesControllerMaxReleaseRate ( 6 )
    TrainBrakesControllerMaxQuickReleaseRate ( 12 )
    TrainBrakesControllerEmergencyApplicationRate ( 12 )
    TrainBrakesControllerMinSystemPressure ( 0 )
    TrainBrakesControllerMaxSystemPressure ( 73 )
    TrainBrakesControllerMaxPressureDropInNormalApplication ( 22 )
    TrainBrakesControllerEmergencyBrakeTimePenalty ( 0 )
    TrainBrakesControllerFullServicePressureDrop ( 22 )
    TrainBrakesControllerDirectControlExponent ( 1.2 )

    DynamicBrakesMinUsableSpeed ( 0 )
    DynamicBrakesFadingSpeed ( 22 )
    DynamicBrakesMaximumEffectiveSpeed ( 84 )
    DynamicBrakesMaximumSpeedForFadeOut ( 150 )
    DynamicBrakesMaximumForce ( 72kN )
    DynamicBrakesResistorCurrentLimit ( 810 )
    DynamicBrakesCutInSpeed ( 0 )
    DynamicBrakesMaxAirBrakePressure ( 70 )
    DynamicBrakesDelayTimeBeforeEngaging ( 0 )
    DynamicBrakesEffectAtMaximumFadeOut ( 0 )
    DynamicBrakesHigherSpeedCurveExponent ( 1 )
    DynamicBrakesLowerSpeedCurveExponent ( 1 )
    DynamicBrakesNumberOfControllerNotches ( 17 )
    DynamicBrakeHasAutoBailOff ( 0 )

    BrakesEngineBrakeType ( Air_single_pipe )
    BrakesTrainBrakeType ( Air_single_pipe )
    TrainPipeLeakRate ( 0.001 )
    BrakesEngineControllers ( "Train, Dynamic" )
    BrakeCutsPowerAtBrakeCylinderPressure ( 15 )
    DoesBrakeCutPower ( 0 )

    comment (-------- Script TCS ORTS --------)
    ORTSTrainControlSystem ( TCS_France.cs )
    ORTSTrainControlSystemSound ( TCS_France.sms )
    ORTSTrainControlSystemParameters ( SNCF_BB25500.ini )

    comment (-------- Moniteurs --------)
    EmergencyStopMonitor (
        MonitoringDeviceMonitorTimeLimit ( 0 )
        MonitoringDeviceAlarmTimeLimit ( 0 )
        MonitoringDevicePenaltyTimeLimit ( 0 )
        MonitoringDeviceCriticalLevel ( 0 )
        MonitoringDeviceResetLevel ( 0 )
        MonitoringDeviceAppliesFullBrake ( 0 )
        MonitoringDeviceAppliesEmergencyBrake ( 1 )
        MonitoringDeviceAppliesCutsPower ( 1 )
        MonitoringDeviceAppliesShutsDownEngine ( 0 )
    )
    AWSMonitor (
        MonitoringDeviceMonitorTimeLimit ( 0 )
        MonitoringDeviceAlarmTimeLimit ( 7 )
        MonitoringDevicePenaltyTimeLimit ( 0 )
        MonitoringDeviceCriticalLevel ( 0 )
        MonitoringDeviceResetLevel ( 0 )
        MonitoringDeviceAppliesFullBrake ( 0 )
        MonitoringDeviceAppliesEmergencyBrake ( 1 )
        MonitoringDeviceAppliesCutsPower ( 0 )
        MonitoringDeviceAppliesShutsDownEngine ( 0 )
    )
    VigilanceMonitor (
        MonitoringDeviceMonitorTimeLimit ( 60 )
        MonitoringDeviceAlarmTimeLimit ( 55 )
        MonitoringDevicePenaltyTimeLimit ( 0 )
        MonitoringDeviceCriticalLevel ( 0 )
        MonitoringDeviceResetLevel ( 0 )
        MonitoringDeviceAppliesFullBrake ( 1 )
        MonitoringDeviceAppliesEmergencyBrake ( 0 )
        MonitoringDeviceAppliesCutsPower ( 0 )
        MonitoringDeviceAppliesShutsDownEngine ( 1 )
        MonitoringDeviceResetOnZeroSpeed ( 1 )
    )
    OverspeedMonitor (
        MonitoringDeviceMonitorTimeLimit ( 0 )
        MonitoringDeviceAlarmTimeLimit ( 0 )
        MonitoringDevicePenaltyTimeLimit ( 0 )
        MonitoringDeviceCriticalLevel ( 150 )
        MonitoringDeviceResetLevel ( 0 )
        MonitoringDeviceAppliesFullBrake ( 1 )
        MonitoringDeviceAppliesEmergencyBrake ( 1 )
        MonitoringDeviceAppliesCutsPower ( 1 )
        MonitoringDeviceAppliesShutsDownEngine ( 0 )
        MonitoringDeviceTriggerOnTrackOverspeed ( 1 )
        MonitoringDeviceTriggerOnTrackOverspeedMargin ( 2 )
        MonitoringDeviceResetOnZeroSpeed ( 1 )
        MonitoringDeviceResetOnResetButton ( 0 )
    )

    comment (-------- Controle et commandes --------)

    EngineControllers (
        Throttle ( 0 1 0.08 0
            NumNotches ( 33
                Notch ( 0.0000 0 Dummy )
                Notch ( 0.0714 0 Dummy )
                Notch ( 0.1091 0 Dummy )
                Notch ( 0.1429 0 Dummy )
                Notch ( 0.1750 0 Dummy )
                Notch ( 0.2062 0 Dummy )
                Notch ( 0.2369 0 Dummy )
                Notch ( 0.2673 0 Dummy )
                Notch ( 0.2974 0 Dummy )
                Notch ( 0.3273 0 Dummy )
                Notch ( 0.3571 0 Dummy )
                Notch ( 0.3869 0 Dummy )
                Notch ( 0.4165 0 Dummy )
                Notch ( 0.4461 0 Dummy )
                Notch ( 0.4756 0 Dummy )
                Notch ( 0.5051 0 Dummy )
                Notch ( 0.5345 0 Dummy )
                Notch ( 0.5639 0 Dummy )
                Notch ( 0.5933 0 Dummy )
                Notch ( 0.6227 0 Dummy )
                Notch ( 0.6521 0 Dummy )
                Notch ( 0.6814 0 Dummy )
                Notch ( 0.7107 0 Dummy )
                Notch ( 0.7400 0 Dummy )
                Notch ( 0.7693 0 Dummy )
                Notch ( 0.7986 0 Dummy )
                Notch ( 0.8279 0 Dummy )
                Notch ( 0.8571 0 Dummy )
                Notch ( 0.8864 0 Dummy )
                Notch ( 0.9157 0 Dummy )
                Notch ( 0.9449 0 Dummy )
                Notch ( 0.9733 0 Dummy )
                Notch ( 1.0000 0 Dummy )
            )
        )
        Brake_Engine ( 0 1 0.50 0.99
            NumNotches ( 3
                Notch ( 0.00    0 EngineBrakesControllerReleaseStart )
                Notch ( 0.50    0 EngineBrakesControllerNeutralhandleOffStart )
                Notch ( 0.99    0 EngineBrakesControllerContinuousServiceStart )
            )
        )
        Brake_Train ( 0 1 0.16 0.5
            NumNotches ( 7
                Notch ( 0.00    0 TrainBrakesControllerFullQuickReleaseStart )
                Notch ( 0.16    0 TrainBrakesControllerReleaseStart )
                Notch ( 0.32    0 TrainBrakesControllerHoldLappedStart )
                Notch ( 0.48    1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                Notch ( 0.64    0 TrainBrakesControllerSuppressionStart )
                Notch ( 0.80    0 TrainBrakesControllerContinuousServiceStart )
                Notch ( 0.96    0 TrainBrakesControllerEmergencyStart )
            )
        )
        Brake_Dynamic ( 0 1 0.1 0
            NumNotches ( 11
                Notch ( 0.00    0 Dummy )
                Notch ( 0.10    0 Dummy )
                Notch ( 0.20    0 Dummy )
                Notch ( 0.30    0 Dummy )
                Notch ( 0.40    0 Dummy )
                Notch ( 0.50    0 Dummy )
                Notch ( 0.60    0 Dummy )
                Notch ( 0.70    0 Dummy )
                Notch ( 0.80    0 Dummy )
                Notch ( 0.90    0 Dummy )
                Notch ( 1.00    0 Dummy )
            )
        )
        Combined_Control ( 0 1 0.50 0.50 throttle dynamic )
        DirControl ( -1 0 1 1 )
        BellToggle ( 0 1 0 )
        AWS ( 0 1 0 )
        Sanding ( 0 1 0 )
        Horn ( 0 1 0 )
        Wipers ( 0 1 0 )
        EmergencyStopToggle ( 0 1 0 )
        Vigilance ( 0 1 0 )
        PantographToggle1 ( 0 1 0 )
        PantographToggle2 ( 0 1 0 )
        Headlights ( 0 0.25 1 0 )
        BailOffButton( 0 1 0 )
    )

    Description (
        "SNCF-BB25574 - GV1 - Dijon 1973-79\n"
    )

    EngineOperatingProcedures (
        "MISE EN SERVICE: \n"+
        "- Monter le panto - touche P\n"+
        "- Allumer les projecteurs - touche H \n"+
        "DEMARRAGE DE LA MACHINE: \n"+
        "- Déserrer le frein de loc - touche ^\n"+
        "- Enclencher la marche avant - touche Z \n"+
        "- Desserrer les freins de trains - touche M \n"+
        "- Augmenter la puissance au manipulateur jusqu'à"+
        "15 à 20%, sans amorcer de patinage - touche D\n"+
        "MONTEE EN VITESSE: \n"+
        "- Augmenter graduellement la puissance sans mettre en "+
        "butée les ampèremètres moteurs et en veillant à ne pas "+
        "amorcer de patinage - touche D\n"+
        "STABILISER LA VITESSE: \n"+
        "- Pas de VI sous MSTS! Jouer sur la puissance traction-"+
        "freinage au manipulateur - touche D/Q\n"+
        "Attention: le paramétrage reproduit le comportement du "+
        "FAMAD, et autorise donc un déserrage progressif. "+
        "Procéder par petites actions successives!"+
        "RETROGRADER ET STOPPER: \n"+
        "- Couper la puissance - touche Q\n"+
        "- Augmenter la puissance du freinage rhéostatique/par "+
        "récupération - touche Q\n"+
        "- Serrer les freins de train - touche ù \n"+
        "AUTRES COMMANDES: \n"+
        "- Sablage - touche X \n"+
        "- Avertisseur long - touche ESPACE \n"+
        "- Avertisseur court - touche B \n"+
        "- VACMA - touche W \n"+
        "AUTRES RECOMMANDATIONS ET REMARQUES: \n"+
        "- L'action sur le frein par récupération libère le frein de loc" \n"+
        "- L'action sur le frein de train agit sur le freinage de la loc" \n"
    )
)
